#include <iostream> 
using namespace std;
int main()
{

	//switch语句
	int x;
	float i;
	cin >> i;
	x = i / 100000;
	i = i / 10000;
	switch (x)
	{
	case 0: cout << "奖金为:" << (i * 0.1) << "万元"; break;
	case 1: cout << "奖金为:" << (10 * 0.1 + (i - 10) * 0.075) << "万元"; break;
	case 2: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + (i - 20) * 0.05) << "万元";  break;
	case 3: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + (i - 20) * 0.05) << "万元"; break;
	case 4: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (i - 40) * 0.03) << "万元";  break;
	case 5: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (i - 40) * 0.03) << "万元";  break;
	case 6: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015) << "万元"; break;
	case 7: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015) << "万元"; break;
	case 8: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015) << "万元"; break;
	case 9: cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015) << "万元"; break;
	default:cout << "奖金为:" << (10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (i - 100) * 0.01) << "万元";
		break;
	}

	/*
	//if语句
	float i;
	cin >> i;
	i = i / 10000;
	if (i <= 10) cout << "奖金为:" << (i * 0.1) << "万元";
	else if (i<=20) cout << "奖金为:" << (10 * 0.1+(i-10)*0.075) << "万元";
	else if (i<=40) cout << "奖金为:" << (10 * 0.1+10*0.075+(i-20)*0.05) << "万元";
	else if (i<=60) cout << "奖金为:" << (10 * 0.1+10*0.075+20*0.05+(i-40)*0.03) << "万元";
	else if (i<=100) cout << "奖金为:" << (10 * 0.1+10*0.075+20*0.05+20*0.03+(i-60)*0.015) << "万元";
	else cout << "奖金为:" << (10 * 0.1+10*0.075+20*0.05+20*0.03+40*0.015+(i-100)*0.01) << "万元";
	return 0;
	*/
}